juan0fran/STM32L4_CC1101/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32l4xx_hal.h"
#include "dma.h"
#include "iwdg.h"
#include "rng.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* USER CODE BEGIN Includes */
#include "cc1101_routine.h"
#include "circular_queue.h"
#include <stdarg.h>
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void print_uart(char * fmt, ...)
{
	/* use of vsprintf */
	  char buffer[256];
	  va_list args;
	  va_start (args, fmt);
	  vsprintf (buffer, fmt, args);
	  va_end (args);
	  if ((buffer[strlen((char *)buffer)-1] != '\n') || (buffer[strlen((char *)buffer)-2] != '\r')){
		  if (buffer[strlen((char *)buffer)-1] == '\n'){
			  buffer[strlen((char *)buffer)-1] = '\r';
			  buffer[strlen((char *)buffer)] = '\n';
		  }else if (buffer[strlen((char *)buffer)-1] != '\n'){
			  strcat((char *)buffer, "\r\n");
		  }
	  }
	  HAL_UART_Transmit_DMA(&huart1, (uint8_t *) buffer, strlen((const char *) buffer));
	  while(huart1.hdmatx->State != HAL_DMA_STATE_READY /* or timeout */);
}
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

//#define _FDEF_SLEEP
//#define _FDEF_UART

extern circ_buff_t circ_buff;
extern circ_buff_t circular_cc1101_queue;

static radio_packet_t packet;

/* USER CODE END 0 */

int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RNG_Init();
  MX_SPI1_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();

  /* USER CODE BEGIN 2 */

#if 1
  HAL_DBGMCU_EnableDBGSleepMode();
  HAL_DBGMCU_EnableDBGStopMode();
  HAL_DBGMCU_EnableDBGStandbyMode();

  int i;
  uint8_t buffer[MAC_PAYLOAD_SIZE];
  uint8_t val;
  uint32_t cnt;

  /* Enable this */
  spi_parms_t spi;
  radio_parms_t radio;

  set_freq_parameters(433.92e6f, 384e3f, 36e3f, &radio);
  set_sync_parameters(PREAMBLE_4, SYNC_30_over_32, 500, &radio);
  set_packet_parameters(false, true, &radio);
  set_modulation_parameters(RADIO_MOD_GFSK, RATE_9600, 0.5f, &radio);

  init_radio_config(&spi, &radio);

  enable_isr_routine(&spi, &radio);

  usart_init_rx();
  /* This timer is in charge of monitoring CC1101 state */
  /* It has some internal timeouts */
  //HAL_TIM_Base_Start_IT(&htim2);

  /* Test! */

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  i = 0;
  cnt = 0;
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
#ifdef _FDEF_SLEEP
	  HAL_SuspendTick();
	  HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFI);
	  HAL_ResumeTick();
#endif
#ifdef _FDEF_UART
	  while (dequeue(&circ_buff, &val) == true){
		  /* HAL_UART_Transmit_DMA(&huart1, buffer, 1); */
		  /* And also send a CC1101 packet */
		  if ( (val != '\n' && val != '\r' ) && cnt < MAC_PAYLOAD_SIZE){
			  buffer[cnt++] = val;
			  HAL_UART_Transmit_DMA(&huart1, &buffer[cnt-1], 1);
			  while(huart1.hdmatx->State != HAL_DMA_STATE_READY /* or timeout */);
		  }else{
			  if (cnt == 0)
				  continue;
			  else{
				  if (val != '\n'){
					  buffer[cnt++] = val;
					  buffer[cnt++] = '\n';
					  HAL_UART_Transmit_DMA(&huart1, &buffer[cnt-2], 2);
					  while(huart1.hdmatx->State != HAL_DMA_STATE_READY /* or timeout */);
				  }else{
					  buffer[cnt++] = val;
					  HAL_UART_Transmit_DMA(&huart1, &buffer[cnt-1], 1);
					  while(huart1.hdmatx->State != HAL_DMA_STATE_READY /* or timeout */);
				  }
			  }
			  buffer[cnt] = '\0';
			  cnt = 0;
			  radio_send_packet(&spi, &radio, buffer, strlen((const char *) buffer)+1);
		  }
	  }
#else
	  HAL_Delay(rand()%1500 + 500);
	  sprintf((char *) buffer, "Test from CC1101 %d\n", i++);
	  radio_send_packet(&spi, &radio, buffer, strlen((const char *) buffer));
#endif
	  while (dequeue(&circular_cc1101_queue, &packet) == true){
		  memset(buffer, 0, sizeof(buffer));
		  sscanf((char *) packet.fields.data, "%[^\n]", (char *) buffer);
		  print_uart("Cnt: %d received -> RSSI: %d, LQI: %d\r\n%s\r\n", cnt++, (int)rssi_dbm(packet.fields.rssi), packet.fields.lqi, buffer);
	  }
  }
#endif
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSI|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 20;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_RNG;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
  PeriphClkInit.RngClockSelection = RCC_RNGCLKSOURCE_PLLSAI1;
  PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_MSI;
  PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
  PeriphClkInit.PLLSAI1.PLLSAI1N = 16;
  PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
  PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
  PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_48M2CLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the main internal regulator output voltage 
    */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
